/*利用指標將陣列內大於40的陣列元素值設為40
使用指標存取語法來遍歷二維陣列，並將超過特定閾值 (40) 的元素值直接修改為40*/
#include<stdio.h>
int main(void)
{
    int num[3][4] = {{12,23,42,18},
                     {43,22,16,14},
                     {31,13,19,28}};
    
    int m,n;
    
    for(m = 0;m < 3; m++)
    {
        for(n = 0;n < 4;n++)
        {
            if(*(*(num+m)+n)>40)        //*(*(num+m)+n) 存取了 num[m][n] 的值。
                *(*(num+m)+n)=40;       //*(*(num+m)+n) 是 L-value (記憶體位置)，將該元素的值直接設為 40。
            printf("%3d",*(*(num+m)+n));
        }
        printf("\n");
    }
    return 0;
}

/*輸出結果：
 12 23 40 18
 40 22 16 14
 31 13 19 28
-------------------------------
1.間接賦值：*(...) 表達式作為 L-value (左值) 使用，成功實現了對二維陣列元素的永久修改。
2.等價語法：*(*(num+m)+n) == num[m][n]*/